In [1]:
import pandas as pd

In [4]:
s=pd.Series([1,2,3,4,5])

In [5]:
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
s.name = 'number'

In [7]:
print(s)

0    1
1    2
2    3
3    4
4    5
Name: number, dtype: int64

In [8]:
fruits = {
    'mango':20,
    'apple':10,
    'orange':200,
    'pine apple':30
}

In [9]:
s = pd.Series(fruits , name='proteins')

In [10]:
print(s)

mango          20
apple          10
orange        200
pine apple     30
Name: proteins, dtype: int64

In [11]:
s['orange'] = 10

In [12]:
print(s)

mango         20
apple         10
orange        10
pine apple    30
Name: proteins, dtype: int64

In [ ]:
print(s.index)

Index(['mango', 'apple', 'orange', 'pine apple'], dtype='object')

In [6]:
# Dataframe
values = {
    'Names':["Dhiraj",'Dinesh','Monisha','Umadevi','Manavalan'],
    'Age':[23,23,29,47,52],
    'Gender':['Male','Male','Female','Female','Male']
}

In [7]:
data=pd.DataFrame(values)

In [8]:
print(data)

       Names  Age  Gender
0     Dhiraj   23    Male
1     Dinesh   23    Male
2    Monisha   29  Female
3    Umadevi   47  Female
4  Manavalan   52    Male

In [9]:
index = ['Me','Twin Brother','Elder Sister','Mother','Father']

In [10]:
data.index = index

In [11]:
print(data)

                  Names  Age  Gender
Me               Dhiraj   23    Male
Twin Brother     Dinesh   23    Male
Elder Sister    Monisha   29  Female
Mother          Umadevi   47  Female
Father        Manavalan   52    Male

In [12]:
print(data.head(2))

               Names  Age Gender
Me            Dhiraj   23   Male
Twin Brother  Dinesh   23   Male

In [13]:
print(data.tail())

                  Names  Age  Gender
Me               Dhiraj   23    Male
Twin Brother     Dinesh   23    Male
Elder Sister    Monisha   29  Female
Mother          Umadevi   47  Female
Father        Manavalan   52    Male

In [14]:
print(data.tail(2))

            Names  Age  Gender
Mother    Umadevi   47  Female
Father  Manavalan   52    Male

In [17]:
print(data.iloc[1:3])

                Names  Age  Gender
Twin Brother   Dinesh   23    Male
Elder Sister  Monisha   29  Female

In [18]:
print(data.iloc[1:3])

                Names  Age  Gender
Twin Brother   Dinesh   23    Male
Elder Sister  Monisha   29  Female

In [28]:
print(data.loc['Me':, ["Age"]])

              Age
Me             23
Twin Brother   23
Elder Sister   29
Mother         47
Father         52

In [32]:
print(data.loc['Twin Brother':, ['Age']])

              Age
Twin Brother   23
Elder Sister   29
Mother         47
Father         52

In [37]:
data.iloc[1:3, 1:3]

              Age  Gender
Twin Brother   23    Male
Elder Sister   29  Female

In [38]:
data["Age"]

Me              23
Twin Brother    23
Elder Sister    29
Mother          47
Father          52
Name: Age, dtype: int64

In [39]:
data[["Gender","Age"]]

              Gender  Age
Me              Male   23
Twin Brother    Male   23
Elder Sister  Female   29
Mother        Female   47
Father          Male   52

In [40]:
data.drop("Age",axis=1)

                  Names  Gender
Me               Dhiraj    Male
Twin Brother     Dinesh    Male
Elder Sister    Monisha  Female
Mother          Umadevi  Female
Father        Manavalan    Male

In [45]:
data.drop("Me",axis=0)

                  Names  Age  Gender
Twin Brother     Dinesh   23    Male
Elder Sister    Monisha   29  Female
Mother          Umadevi   47  Female
Father        Manavalan   52    Male

In [46]:
data

                  Names  Age  Gender
Me               Dhiraj   23    Male
Twin Brother     Dinesh   23    Male
Elder Sister    Monisha   29  Female
Mother          Umadevi   47  Female
Father        Manavalan   52    Male

In [47]:
data.shape

(5, 3)

In [49]:
print(data.shape)

(5, 3)

In [50]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Me to Father
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Names   5 non-null      object
 1   Age     5 non-null      int64
 2   Gender  5 non-null      object
dtypes: int64(1), object(2)
memory usage: 332.0+ bytes

In [51]:
data.describe()

             Age
count   5.000000
mean   34.800000
std    13.754999
min    23.000000
25%    23.000000
50%    29.000000
75%    47.000000
max    52.000000

In [52]:
data

                  Names  Age  Gender
Me               Dhiraj   23    Male
Twin Brother     Dinesh   23    Male
Elder Sister    Monisha   29  Female
Mother          Umadevi   47  Female
Father        Manavalan   52    Male

In [61]:

values = {
    'Names':["Dhiraj",'Dinesh','Monisha','Umadevi','Manavalan'],
    'Age':[23,23,29,47,52],
    'Gender':['Male','Male','Female','Female','Male'],
    'Salary':[2000,3000,4000,5000,6000]

}

In [62]:
data = pd.DataFrame(values)

In [63]:
data

       Names  Age  Gender  Salary
0     Dhiraj   23    Male    2000
1     Dinesh   23    Male    3000
2    Monisha   29  Female    4000
3    Umadevi   47  Female    5000
4  Manavalan   52    Male    6000

In [67]:
data.iloc[1:3, :2]

     Names  Age
1   Dinesh   23
2  Monisha   29

In [ ]:
# Broadcasting
data["Salary"] = data["Salary"]+5000

In [69]:
data

       Names  Age  Gender  Salary
0     Dhiraj   23    Male    7000
1     Dinesh   23    Male    8000
2    Monisha   29  Female    9000
3    Umadevi   47  Female   10000
4  Manavalan   52    Male   11000